{
  "_name_or_path": "mesh-xl/mesh-xl-125m",
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "OPTForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 2,
  "do_layer_norm_before": true,
  "dropout": 0.1,
  "eos_token_id": 2,
  "ffn_dim": 1024,
  "hidden_size": 256,
  "init_std": 0.02,
  "layerdrop": 0.0,
  "max_position_embeddings": 1024,
  "model_type": "opt",
  "num_attention_heads": 4,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "prefix": "</s>",
  "torch_dtype": "float16",
  "transformers_version": "4.21.0.dev0",
  "use_cache": true,
  "vocab_size": 131,
  "word_embed_proj_dim": 256
}